---
kind: method
id: M:Autodesk.Revit.DB.Macros.DocumentEntryPoint.Initialize(System.Object,System.String)
source: html/6a99b8ac-b10c-b841-dbaa-2749c01af925.htm
---
# Autodesk.Revit.DB.Macros.DocumentEntryPoint.Initialize Method

For Revit Macros internal use only.

## Syntax (C#)
```csharp
public void Initialize(
	Object obj,
	string addinFolder
)
```

## Parameters
- **obj** (`System.Object`)
- **addinFolder** (`System.String`)